# ForwardIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PlanTopologySet..::..ForwardIterator Method
PlanTopologySet Class See Also
---
Retrieve a forward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual PlanTopologySetIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As PlanTopologySetIterator
```

Visual C++
---
```text
public:
virtual PlanTopologySetIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the set.
# See Also
PlanTopologySet Class
Autodesk.Revit.DB Namespace